In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
drinks = pd.read_csv("http://bit.ly/drinksbycountry")
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [3]:
drinks.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

In [4]:
drinks.index

RangeIndex(start=0, stop=193, step=1)

In [5]:
drinks.set_index("country") # returns a new dataFrame

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa
...,...,...,...,...,...
Venezuela,333,100,3,7.7,South America
Vietnam,111,2,1,2.0,Asia
Yemen,6,0,0,0.1,Asia
Zambia,32,19,4,2.5,Africa
Zimbabwe,64,18,4,4.7,Africa

In [6]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [7]:
drinks.set_index("country", inplace=True)
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

In [8]:
drinks.columns

Index(['beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

In [9]:
drinks.index

Index(['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola',
       'Antigua & Barbuda', 'Argentina', 'Armenia', 'Australia', 'Austria',
       ...
       'Tanzania', 'USA', 'Uruguay', 'Uzbekistan', 'Vanuatu', 'Venezuela',
       'Vietnam', 'Yemen', 'Zambia', 'Zimbabwe'],
      dtype='object', name='country', length=193)

In [10]:
drinks.set_index("country", inplace=True)

KeyError: "None of ['country'] are in the columns"

In [ ]:
# loc -> location
# iloc -> integer location

In [11]:
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

In [12]:
drinks.loc["Turkey", "beer_servings"]

51

In [14]:
drinks.loc["Albania", "beer_servings"]

89

In [15]:
drinks.loc["Albania", "beer_servings"] = 91
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,91,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

In [18]:
drinks.loc[["Argentina", "Brazil"], ["beer_servings", "wine_servings"]]

           beer_servings  wine_servings
country
Argentina            193            221
Brazil               245             16

In [19]:
drinks.loc["Argentina":"Brazil", ["beer_servings", "wine_servings"]]

                    beer_servings  wine_servings
country
Argentina                     193            221
Armenia                        21             11
Australia                     261            212
Austria                       279            191
Azerbaijan                     21              5
Bahamas                       122             51
Bahrain                        42              7
Bangladesh                      0              0
Barbados                      143             36
Belarus                       142             42
Belgium                       295            212
Belize                        263              8
Benin                          34             13
Bhutan                         23              0
Bolivia                       167              8
Bosnia-Herzegovina             76              8
Botswana                      173             35
Brazil                        245             16

In [21]:
drinks.loc["Argentina":"Brazil":2, "beer_servings":"wine_servings"]

            beer_servings  spirit_servings  wine_servings
country
Argentina             193               25            221
Australia             261               72            212
Azerbaijan             21               46              5
Bahrain                42               63              7
Barbados              143              173             36
Belgium               295               84            212
Benin                  34                4             13
Bolivia               167               41              8
Botswana              173               35             35

In [22]:
drinks.loc["Argentina":"Brazil":2, :]

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Argentina,193,25,221,8.3,South America
Australia,261,72,212,10.4,Oceania
Azerbaijan,21,46,5,1.3,Europe
Bahrain,42,63,7,2.0,Asia
Barbados,143,173,36,6.3,North America
Belgium,295,84,212,10.5,Europe
Benin,34,4,13,1.1,Africa
Bolivia,167,41,8,3.8,South America
Botswana,173,35,35,5.4,Africa

In [23]:
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,91,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

In [24]:
drinks.iloc[2, 0]

25

In [25]:
drinks.iloc[:5, [0, 2]]

             beer_servings  wine_servings
country
Afghanistan              0              0
Albania                 91             54
Algeria                 25             14
Andorra                245            312
Angola                 217             45

In [26]:
drinks.loc["Turkey", "wine_servings"]

7

In [36]:
# Let's get the Turkey's wine_servings value with iloc

row_idx = list(drinks.index).index("Turkey")
col_idx = list(drinks.columns).index("wine_servings")
drinks.iloc[row_idx, col_idx]

7

In [37]:
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,91,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

In [38]:
drinks.reset_index(inplace=True)
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,91,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [39]:
# Create a DataFrame with a custom index
data = {'Name': ['Alice', 'Bob', 'Charlie', 'Jack'],
        'Age': [25, 30, 35, 28]}
df = pd.DataFrame(data, index=['A', 'B', 'C', 'B'])
df

      Name  Age
A    Alice   25
B      Bob   30
C  Charlie   35
B     Jack   28

In [40]:
df.loc["B", :]

   Name  Age
B   Bob   30
B  Jack   28

In [41]:
ufos = pd.read_csv("http://bit.ly/uforeports")
ufos.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [42]:
ufos.groupby("State").size()

State
AK     116
AL     193
AR     206
AZ     738
CA    2529
CO     367
CT     225
Ca       1
DE      43
FL     837
Fl       4
GA     325
HI      85
IA     162
ID     130
IL     613
IN     326
KS     176
KY     244
LA     174
MA     322
MD     215
ME     181
MI     591
MN     254
MO     448
MS     139
MT     144
NC     356
ND      51
NE     101
NH     125
NJ     370
NM     241
NV     284
NY     914
OH     667
OK     193
OR     534
PA     598
RI      67
SC     166
SD      57
TN     286
TX    1027
UT     193
VA     299
VT      44
WA    1322
WI     357
WV     132
WY      69
dtype: int64

In [44]:
res = ufos.groupby(["City", "State"]).size() # MultiIndex
res

City                                 State
Abbeville                            SC       1
Aberdeen                             MD       2
                                     OH       1
                                     SD       1
                                     WA       4
                                             ..
none                                 NV       1
not shure                            ME       1
observer enroute on MN hwy 61 north  MN       1
on plane wing                        NY       1
south of the border                  NC       1
Length: 8028, dtype: int64

In [45]:
res.values

array([1, 2, 1, ..., 1, 1, 1])

In [46]:
res.index

MultiIndex([(                          'Abbeville', 'SC'),
            (                           'Aberdeen', 'MD'),
            (                           'Aberdeen', 'OH'),
            (                           'Aberdeen', 'SD'),
            (                           'Aberdeen', 'WA'),
            (                            'Abilene', 'KS'),
            (                            'Abilene', 'TX'),
            (                           'Abingdon', 'IL'),
            (                           'Abingdon', 'VA'),
            (                             'Acampo', 'CA'),
            ...
            (                            'no data', 'TN'),
            (                            'no data', 'TX'),
            (                            'no data', 'UT'),
            (                               'none', 'FL'),
            (                               'none', 'MI'),
            (                               'none', 'NV'),
            (                          'not shure', 'ME'),
            ('observer enroute on MN hwy 61 north', 'MN'),
            (                      'on plane wing', 'NY'),
            (                'south of the border', 'NC')],
           names=['City', 'State'], length=8028)

In [48]:
res.index[0]

('Abbeville', 'SC')

In [49]:
res.index[0][0]

'Abbeville'

In [50]:
res.index[0][1]

'SC'

In [51]:
ufos.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [52]:
ufos.isnull()

        City  Colors Reported  Shape Reported  State   Time
0      False             True           False  False  False
1      False             True           False  False  False
2      False             True           False  False  False
3      False             True           False  False  False
4      False             True           False  False  False
...      ...              ...             ...    ...    ...
18236  False             True           False  False  False
18237  False             True           False  False  False
18238  False             True            True  False  False
18239  False            False           False  False  False
18240  False             True           False  False  False

[18241 rows x 5 columns]

In [55]:
ufos.shape

(18241, 5)

In [53]:
ufos.isnull().sum()

City                  26
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

In [56]:
ufos.isnull().sum().sum()

18029